casesBaseline/NOIB_baseCase/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  LES;

LES
{

	LESModel       WALE; 
	
	turbulence      on;

	delta           smooth;

	printCoeffs     on;

	oneEqEddyCoeffs
	{
	    ce               1.05;
	    filter          simple;
	}



	cubeRootVolCoeffs
	{
	    deltaCoeff      1;
	}

	PrandtlCoeffs
	{
	    delta           cubeRootVol;
	    cubeRootVolCoeffs
	    {
		deltaCoeff      1;
	    }

	    smoothCoeffs
	    {
		delta           cubeRootVol;
		cubeRootVolCoeffs
		{
		    deltaCoeff      1;
		}

		maxDeltaRatio   1.1;
	    }

	    Cdelta          0.158;
	}

	vanDriestCoeffs
	{
	    delta           cubeRootVol;
	    cubeRootVolCoeffs
	    {
		deltaCoeff      1;
	    }

	    smoothCoeffs
	    {
		delta           cubeRootVol;
		cubeRootVolCoeffs
		{
		    deltaCoeff      1;
		}

		maxDeltaRatio   1.1;
	    }

	    Aplus           26;
	    Cdelta          0.158;
	}

	smoothCoeffs
	{
	    delta           cubeRootVol;
	    cubeRootVolCoeffs
	    {
		deltaCoeff      1;
	    }

	    maxDeltaRatio   1.1;
	}
}


// ************************************************************************* //
