casesBaseline/NOIB_baseCase/constant/thermodynamicProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermodynamicProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Cvv             Cvv [ 0 2 -2 -1 0 0 0 ] 1410.8;

Cvl             Cvl [ 0 2 -2 -1 0 0 0 ] 4180.0;

Cpv             Cpv [ 0 2 -2 -1 0 0 0 ] 1984.8;

Cpl             Cpl [ 0 2 -2 -1 0 0 0 ] 4180.0;

kv              kv [ 1 1 -3 -1 0 0 0 ] 0.016;

kl              kl [ 1 1 -3 -1 0 0 0 ] 0.58;

Lv              Lv [ 0 2 -2 -1 0 0 0 ] 2375300.0;

el0             el0 [ 0 2 -2 0 0 0 0 ] 617.0;

R               R [ 0 2 -2 -1 0 0 0 ] 461.6;

T0              T0 [ 0 0 0 1 0 0 0 ] 273.15;

Tc              Tc [ 0 0 0 1 0 0 0 ] 647.16;

p_c             p_c [ 1 -1 -2 0 0 0 0 ] 22120000.0;

rho_c           rho_c [ 1 -3 0 0 0 0 0 ] 322.0;

B               B [ 1 -1 -2 0 0 0 0 ] 330000000.0;

n               7.15;

gama            1.327;

rholSat         rholSat [ 1 -3 0 0 0 0 0 ] 998.2;

rhovSat         rhovSat [ 1 -3 0 0 0 0 0 ] 0.0173;

pSat            pSat [ 1 -1 -2 0 0 0 0 ] 2339.0;

C_satL          C_satL [ 0 1 -1 0 0 0 0 ] 1450.0;


// ************************************************************************* //
