casesBaseline/NOIB_baseCase/0/org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);

boundaryField
{
nozzlle2
    {
        type            zeroGradient;
    }
    
nozzle1
    {
    	type		zeroGradient;
    }
	needle
    {
    	type		zeroGradient;
    }
cylinder
    {
    	type		zeroGradient;
    }
    wallcylinder
    {
        type            zeroGradient;
    }	
    inlet//
    {
    	type		zeroGradient;
    }
    outlet//
    {
    	type		zeroGradient;
    }  
}
// ************************************************************************* //
