casesBaseline/NOIB_baseCase/0/org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    
        nozzle1
    {
        type            zeroGradient;
    }

    nozzlle2
    {
    	type		zeroGradient;
    }
cylinder
    {
    	type		zeroGradient;
    }
    wallcylinder
    {
        type            zeroGradient;
    }

   needle
    {
        type            zeroGradient;
    }	
    inlet//
    {
    	type		fixedValue;
    	value		uniform 150000000;
    }
    outlet//
    {
    type            zeroGradient;
    } 
}

// ************************************************************************* //
