casesBaseline/NOIB_baseCase/0/org/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 0;

boundaryField
{
    cylinder
    {
    	type		zeroGradient;
    }
    wallcylinder
    {
        type            zeroGradient;
    }	
	 needle
    {
    	type		zeroGradient;
    }
      nozzlle2
    {
        type            zeroGradient;
    }

	nozzle1
    {
    	type		zeroGradient;
    }
    inlet//
    {
    	type		fixedValue;
    	value		uniform 363;
    }
    outlet//
    {
    type            zeroGradient;
    }    
}


// ************************************************************************* //
