casesBaseline/NOIB_baseCase/0/org/alphat
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    cylinder
    {
        type            calculated;//compressible::alphatWallFunction;
        //Prt             0.85;
        value           uniform 0;
    }
        wallcylinder
    {
        type            calculated;//compressible::alphatWallFunction;
        //Prt             0.85;
        value           uniform 0;

    }
    nozzle1
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           uniform 0;
    }
    nozzlle2
    {
	type		compressible::alphatWallFunction;
	Prt		0.85;
	value		uniform 0;
    }
    inlet
    {
        type            calculated;
	value		uniform 0;

    }
    outlet
    {
	type		calculated;
        value           uniform 0;


    }
    needle
    {
	type		compressible::alphatWallFunction;
	Ptr		0.85;
	value		uniform 0;
    }

}


// ************************************************************************* //
