casesBaseline/NOIB_baseCase/0/org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.0001";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0;
  
boundaryField
{
      cylinder
      {
          type           zeroGradient;// kqRWallFunction;
	  //value		 $internalField;
      }  
    wallcylinder
    {
        type            zeroGradient;
    } 
        nozzle1
      {
          type            kqRWallFunction;
	  value		$internalField;
      }
          nozzlle2
      {
          type            kqRWallFunction;
           value         $internalField; 
      }
          needle
      {
          type            kqRWallFunction;
           value         $internalField; 
      }
      inlet//
      {
          type            zeroGradient;
      }
      outlet//
      {
          type            zeroGradient;
      }    
}

