casesBaseline/NOIB_baseCase/system/surfaceFeaturesDict
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          surfaceFeaturesDict;
}

// Exported by SnappyHexMesh GUI add-on for Blender v1.0
// Source file: C:\Users\Usuario\Desktop\finalmesh\FINALMESH3\BIEN.blend
// Export date: 2022-06-10 16:00:41.633282



surfaces
(
    "cylinder.stl"
    "inlet.stl"
    "needle.stl"
    "nozzle1.stl"
    "nozzlle2.stl"
    "outlet.stl"
    "wallcylinder.stl"
);

includedAngle   150;


